<?php
$oblasti = ["Киевская область" => ["Киев", "Белая Церковь", "Бровары", "Кгород"],
            "Житомирская область" => ["Житомир","Коростень","Новоград-Волынский","Бердичев"],
            "Винницкая область" => ["Винница","Могилев-Подольский","Жмеринка","Казатин"]];

foreach($oblasti as $oblast => $goroda){
    echo "<br>";
    echo $oblast . ":<br>";
    $j = 0;
    $count = 0;
    $str = "";
        for($i = 0; $i < count($goroda); $i++){
            if(mb_substr($goroda[$i] , 0,1, 'UTF-8') === 'К'){
                $j++;
                if($j - $count == 2){
                    $str .= ", ";
                    $count++;
                }
                $str .= $goroda[$i];
            
            }
        }
    echo "$str<br>";

}